Repository: thessaly/emg-test
Catalog: locale/*/LC_MESSAGES/chapter-1.po
Languages: es

source: <mark>Experimental practical</mark>
es: <mark>Práctica experimental</mark>

source: Ch. 1: Muscle physiology and EMG basics
es: Cap. 1: Fisiología muscular y conceptos básicos de EMG

source: **Authors:** Erin McKiernan **Affiliation:** Universidad Nacional Autónoma de México (UNAM), Open Research Community Accelerator (ORCA) **Date:** February 16, 2025
es: **Autores:** Erin McKiernan **Afiliación:** Universidad Nacional Autónoma de México (UNAM), Open Research Community Accelerator (ORCA) **Fecha:** 16 de febrero de 2025

source: Overview
es: Resumen

source: In this experimental practical, students learn about the basics of muscle structure and function, and how muscles provide the force to move the three types of lever system found in the human body. Students learn how to record from their skeletal muscles using electromyography, recording muscles from all three types of lever system. Overall, this practical is designed to help students understand the biomechanics of the musculoskeletal system, and how movement is related to electrical activity in excitable muscle cells. The duration of the practical can be as short as 30 minutes or up to 2 hours, depending on the number of muscles recorded and the complexity of the different muscle activities explored.
es: En esta práctica experimental, los estudiantes aprenden los conceptos básicos de la estructura y función muscular, y cómo los músculos proporcionan la fuerza para mover los tres tipos de sistemas de palanca que se encuentran en el cuerpo humano. Los estudiantes aprenden a registrar desde sus músculos esqueléticos usando electromiografía, registrando músculos de los tres tipos de sistemas de palanca. En general, esta práctica está diseñada para ayudar a los estudiantes a comprender la biomecánica del sistema musculoesquelético, y cómo el movimiento se relaciona con la actividad eléctrica en las células musculares excitables. La duración de la práctica puede ser tan corta como 30 minutos o hasta 2 horas, dependiendo del número de músculos registrados y la complejidad de las diferentes actividades musculares exploradas.

source: Learning objectives
es: Objetivos de aprendizaje

source: **Before** this practical, students should be able to:
es: **Antes** de esta práctica, los estudiantes deberían ser capaces de:

source: identify and describe the function of different cellular components and compartments (e.g. plasma membrane, endoplasmic reticulum)
es: identificar y describir la función de diferentes componentes y compartimentos celulares (ej. membrana plasmática, retículo endoplasmático)

source: understand the basics of action potential generation, e.g. at the neuromuscular junction
es: comprender los conceptos básicos de la generación de potenciales de acción, ej. en la unión neuromuscular

source: explain basic concepts in physics, like lever function, work, and force
es: explicar conceptos básicos de física, como función de palanca, trabajo y fuerza

source: **During** this practical, students will:
es: **Durante** esta práctica, los estudiantes:

source: learn how to record electromyograms (EMGs) from skeletal muscles
es: aprenderán cómo registrar electromiogramas (EMG) de músculos esqueléticos

source: observe and record changes in the EMG when muscles contract and relax
es: observarán y registrarán cambios en el EMG cuando los músculos se contraen y relajan

source: investigate the effects of changing the speed and force of contraction on EMG signals
es: investigarán los efectos de cambiar la velocidad y fuerza de contracción en las señales EMG

source: compare and contrast recordings from three different lever systems in the body
es: compararán y contrastarán registros de tres sistemas de palanca diferentes en el cuerpo

source: **After** this practical, students should be able to:
es: **Después** de esta práctica, los estudiantes deberían ser capaces de:

source: explain the relationship between muscle cell electrical activity and muscle contraction
es: explicar la relación entre la actividad eléctrica de las células musculares y la contracción muscular

source: understand the basics of EMG recording
es: comprender los conceptos básicos del registro EMG

source: design further experiments to investigate the activity of different skeletal muscles
es: diseñar experimentos adicionales para investigar la actividad de diferentes músculos esqueléticos

source: Equipment and materials
es: Equipo y materiales

source: 9V battery to power SpikerBox
es: Batería de 9V para alimentar el SpikerBox

source: Round surface electrodes (any medical supply provider)
es: Electrodos de superficie redondos (cualquier proveedor de suministros médicos)

source: Cable with alligator clips to connect electrodes to SpikerBox (Backyard Brains)
es: Cable con pinzas cocodrilo para conectar electrodos al SpikerBox (Backyard Brains)

source: Cable to connect SpikerBox to a computer, tablet, or smartphone (Backyard Brains)
es: Cable para conectar SpikerBox a una computadora, tableta o teléfono inteligente (Backyard Brains)

source: Computer, tablet, or phone with free Backyard Brains [Spike Recorder software](https://backyardbrains.com/products/byb-spike-recorder) installed
es: Computadora, tableta o teléfono con el software gratuito [Spike Recorder de Backyard Brains](https://backyardbrains.com/products/byb-spike-recorder) instalado

source: Phone or tablet adaptor, 3.5mm aux to USB-C (if no aux port on devices; any provider)
es: Adaptador para teléfono o tableta, de aux 3.5mm a USB-C (si no hay puerto aux en los dispositivos; cualquier proveedor)

source: Alcohol and cotton swabs to help remove electrodes after recording (optional)
es: Alcohol y hisopos de algodón para ayudar a remover electrodos después del registro (opcional)

source: Other indications: Wear loose clothing to permit electrode placement
es: Otras indicaciones: Usar ropa holgada para permitir la colocación de electrodos

source: Background information
es: Información de antecedentes

source: Skeletal muscles provide force to move levers in human body
es: Los músculos esqueléticos proporcionan fuerza para mover palancas en el cuerpo humano

source: Movements of the human musculoskeletal system are accomplished by sets of bones, joints, and muscles that work together much like lever systems {cite:p}`leversOLI, guyton2016book, openStax_lever`. A lever is composed of a rigid rod or bar (the lever arm) that pivots about a fixed point (the fulcrum) and can move a load or overcome a resistance when a force is applied. Levers are grouped into three classes, depending on the relative placement of the fulcrum, force applied, and the load or resistance ({numref}`01-1`). Class 1 levers have a central fulcrum with the force applied on one side and the load on the other (e.g., a crowbar). For class 2 levers, the load is central and the force and fulcrum are on either side (e.g., a wheelbarrow). For class 3 levers, the force is applied centrally and the fulcrum and load on are opposing ends of the arm (e.g. a pair of tweezers is a pair of 3rd class levers).
es: Los movimientos del sistema musculoesquelético humano se logran mediante conjuntos de huesos, articulaciones y músculos que trabajan juntos de forma muy similar a los sistemas de palanca {cite:p}`leversOLI, guyton2016book, openStax_lever`. Una palanca está compuesta por una barra o varilla rígida (el brazo de palanca) que gira alrededor de un punto fijo (el fulcro) y puede mover una carga o superar una resistencia cuando se aplica una fuerza. Las palancas se agrupan en tres clases, dependiendo de la colocación relativa del fulcro, la fuerza aplicada y la carga o resistencia ({numref}`01-1`). Las palancas de clase 1 tienen un fulcro central con la fuerza aplicada en un lado y la carga en el otro (ej., una palanca). Para las palancas de clase 2, la carga es central y la fuerza y el fulcro están en lados opuestos (ej., una carretilla). Para las palancas de clase 3, la fuerza se aplica centralmente y el fulcro y la carga están en extremos opuestos del brazo (ej. un par de pinzas es un par de palancas de tercera clase).

source: The three classes of levers — class 1 (a), class 2 (b), and class 3 (c) — with corresponding examples in the human body. Shown are the relative positions of the fulcrum (F), resistance (R), and effort (E) or force applied in each case. Image credit: "Lever Systems of the Human Body" by Daniel Donnelly, CC BY 4.0, Retrieved from <a href="https://www.flickr.com/photos/187096960@N06/51172431376">https://www.flickr.com/photos/187096960@N06/51172431376</a>
es: Las tres clases de palancas — clase 1 (a), clase 2 (b) y clase 3 (c) — con ejemplos correspondientes en el cuerpo humano. Se muestran las posiciones relativas del fulcro (F), resistencia (R) y esfuerzo (E) o fuerza aplicada en cada caso. Crédito de imagen: "Sistemas de Palanca del Cuerpo Humano" por Daniel Donnelly, CC BY 4.0, Recuperado de <a href="https://www.flickr.com/photos/187096960@N06/51172431376">https://www.flickr.com/photos/187096960@N06/51172431376</a>

source: In the human body, bones act as lever arms and joints as fulcrums. The force to overcome a resistance or lift a load is provided by the contraction of skeletal muscles, which are attached to the bones by tendons {cite:p}`leversOLI, guyton2016book, openStax_lever`. All three classes of levers are found in the human body, though some are more common than others. Class 1 levers are rare, but a few examples do exist, including the bone-joint system responsible for head flexion and extension (lowering or lifting the head, respectively; {numref}`01-1`a). In this case, the fulcrum is the joint between the cranium and the first cervical vertebrae. The load, or resistance, is the weight of the head itself. The force to lift the head is applied by contraction of skeletal muscles in the neck and upper back, including the splenius capitis and semispinalis capitis {cite}`openStax_axial`. The lever arm in this case is not as obvious as in long-bone systems, but is the cranium itself. A line can be imagined running diagonally from the neck muscles on the left, up through the cervical joint, and ending at a point on the cranium above the eye socket.
es: En el cuerpo humano, los huesos actúan como brazos de palanca y las articulaciones como fulcros. La fuerza para superar una resistencia o levantar una carga es proporcionada por la contracción de músculos esqueléticos, que están unidos a los huesos por tendones {cite:p}`leversOLI, guyton2016book, openStax_lever`. Las tres clases de palancas se encuentran en el cuerpo humano, aunque algunas son más comunes que otras. Las palancas de clase 1 son raras, pero existen algunos ejemplos, incluyendo el sistema hueso-articulación responsable de la flexión y extensión de la cabeza (bajar o levantar la cabeza, respectivamente; {numref}`01-1`a). En este caso, el fulcro es la articulación entre el cráneo y la primera vértebra cervical. La carga, o resistencia, es el peso de la cabeza misma. La fuerza para levantar la cabeza es aplicada por la contracción de músculos esqueléticos en el cuello y la parte superior de la espalda, incluyendo el esplenio de la cabeza y semiespinal de la cabeza {cite}`openStax_axial`. El brazo de palanca en este caso no es tan obvio como en los sistemas de huesos largos, pero es el cráneo mismo. Se puede imaginar una línea que va diagonalmente desde los músculos del cuello en la izquierda, hacia arriba a través de la articulación cervical, y termina en un punto del cráneo arriba de la cuenca del ojo.

source: When a person stands on tip toes, we can see an example of a class 2 lever in the human body ({numref}`01-1`b). The foot is the lever arm, the joints between the bones of the foot and those of the toes — the metatarsophalangeal joints {cite}`openStax_lower` — act as the fulcrum, and the load is the person's body weight {cite}`leversOLI`. The force required to lift the body is provided by contraction of the gastrocnemius and soleus muscles in the calf {cite}`openStax_limbs`.
es: Cuando una persona se para en punta de pies, podemos ver un ejemplo de una palanca de clase 2 en el cuerpo humano ({numref}`01-1`b). El pie es el brazo de palanca, las articulaciones entre los huesos del pie y los de los dedos — las articulaciones metatarsofalángicas {cite}`openStax_lower` — actúan como el fulcro, y la carga es el peso corporal de la persona {cite}`leversOLI`. La fuerza requerida para levantar el cuerpo es proporcionada por la contracción de los músculos gastrocnemio y sóleo en la pantorrilla {cite}`openStax_limbs`.

source: Class 3 levers are the most observed type in the human body {cite}`leversOLI`. The classical example is the complex formed by the biceps brachii, elbow, and forearm ({numref}`01-1`c). In this example, the forearm is the lever arm, the elbow joint is the fulcrum, and the force required to move the arm upwards (flex) or lift a load is provided by the bicep.
es: Las palancas de clase 3 son el tipo más observado en el cuerpo humano {cite}`leversOLI`. El ejemplo clásico es el complejo formado por el bíceps braquial, el codo y el antebrazo ({numref}`01-1`c). En este ejemplo, el antebrazo es el brazo de palanca, la articulación del codo es el fulcro, y la fuerza requerida para mover el brazo hacia arriba (flexionar) o levantar una carga es proporcionada por el bíceps.

source: Skeletal muscle structure
es: Estructura del músculo esquelético

source: To understand how muscles contract, we must first know about their structure. Skeletal muscles are composed of multiple fascicles, which are bundles of many smaller muscle fibers surrounded by a layer of connective tissue ({numref}`01-2`). Each muscle fiber is itself composed of many smaller myofibrils, containing the molecular machinery for contraction {cite:p}`guyton2016book, openStax_muscle`. In many skeletal muscles, the fascicles are aligned parallel to one another, running along the length of the muscle. Other muscles show a circular fascicle arrangement. Some muscles have fascicles which meet at one attachment point (convergent), while others feather out from a central tendon (pennate). The arrangement of the fascicles affects the direction and angle at which the fibers can pull, and also affects force generation in the muscle {cite}`openStax_lever`.
es: Para entender cómo se contraen los músculos, primero debemos conocer su estructura. Los músculos esqueléticos están compuestos por múltiples fascículos, que son haces de muchas fibras musculares más pequeñas rodeadas por una capa de tejido conectivo ({numref}`01-2`). Cada fibra muscular está compuesta a su vez por muchas miofibrillas más pequeñas, que contienen la maquinaria molecular para la contracción {cite:p}`guyton2016book, openStax_muscle`. En muchos músculos esqueléticos, los fascículos están alineados paralelos entre sí, corriendo a lo largo de la longitud del músculo. Otros músculos muestran un arreglo circular de fascículos. Algunos músculos tienen fascículos que se encuentran en un punto de inserción (convergente), mientras que otros se extienden desde un tendón central (penniforme). El arreglo de los fascículos afecta la dirección y el ángulo en el que las fibras pueden tirar, y también afecta la generación de fuerza en el músculo {cite}`openStax_lever`.

source: Muscle structure and levels of organization. The top image shows the muscle fascicles. The middle image zooms in on one fascicle to show the muscle fibers. The bottom image zooms in on one muscle fiber to show the myofibrils. Image credit: OpenStax, CC BY 4.0, Retrieved from: <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle">https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle</a>
es: Estructura muscular y niveles de organización. La imagen superior muestra los fascículos musculares. La imagen del medio hace zoom en un fascículo para mostrar las fibras musculares. La imagen inferior hace zoom en una fibra muscular para mostrar las miofibrillas. Crédito de imagen: OpenStax, CC BY 4.0, Recuperado de: <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle">https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle</a>

source: Surrounding the muscle fiber is the plasma membrane, or sarcolemma. In the sarcolemma are embedded transmembrane proteins, like ion channels that mediate currents and permit the generation of muscle action potentials (APs). These APs propagate via invaginations in the sarcolemma, known as tranverse (T) tubules ({numref}`01-3`). Positioned right next to the T-tubules is the sarcoplasmic reticulum, the equivalent of endoplasmic reticulum in muscle. Here, select channels respond to the changes in voltage generated by the propagating APs to initiate intracellular events that activate the contractile machinery {cite:p}`guyton2016book, openStax_muscle`.
es: Rodeando la fibra muscular está la membrana plasmática, o sarcolema. En el sarcolema están incrustadas proteínas transmembrana, como canales iónicos que median corrientes y permiten la generación de potenciales de acción musculares (PA). Estos PA se propagan a través de invaginaciones en el sarcolema, conocidas como túbulos transversos (T) ({numref}`01-3`). Posicionado justo al lado de los túbulos T está el retículo sarcoplasmático, el equivalente del retículo endoplasmático en el músculo. Aquí, canales selectos responden a los cambios en voltaje generados por los PA que se propagan para iniciar eventos intracelulares que activan la maquinaria contráctil {cite:p}`guyton2016book, openStax_muscle`.

source: Invaginations in the sarcolemma form the T-tubules, which run down the myofibrils and are flanked by sarcoplasmic reticulum (SR) on either side. <em>Right</em>: Near the SR, proteins are arranged in sarcomeres, the contractile unit of muscle. Image credit: OpenStax, CC BY 4.0, via Wikimedia Commons <a href="https://upload.wikimedia.org/wikipedia/commons/9/94/1023_T-tubule.jpg">https://upload.wikimedia.org/wikipedia/commons/9/94/1023_T-tubule.jpg</a> and <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle">https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle</a>
es: Las invaginaciones en el sarcolema forman los túbulos T, que corren por las miofibrillas y están flanqueados por retículo sarcoplasmático (RS) en ambos lados. <em>Derecha</em>: Cerca del RS, las proteínas están organizadas en sarcómeros, la unidad contráctil del músculo. Crédito de imagen: OpenStax, CC BY 4.0, vía Wikimedia Commons <a href="https://upload.wikimedia.org/wikipedia/commons/9/94/1023_T-tubule.jpg">https://upload.wikimedia.org/wikipedia/commons/9/94/1023_T-tubule.jpg</a> y <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle">https://openstax.org/books/anatomy-and-physiology/pages/10-2-skeletal-muscle</a>

source: The functional contractile unit of skeletal muscle is known as the sarcomere. In skeletal muscles, sarcomeres are arranged in series along the length of the myofibrils. Regular and repeated changes in the density of particular proteins in the sarcomeres is what give skeletal muscles their striped, or striated, look microscopically {cite:p}`Rall2018What`.
es: La unidad contráctil funcional del músculo esquelético se conoce como sarcómero. En los músculos esqueléticos, los sarcómeros están organizados en serie a lo largo de la longitud de las miofibrillas. Los cambios regulares y repetidos en la densidad de proteínas particulares en los sarcómeros es lo que da a los músculos esqueléticos su apariencia rayada, o estriada, microscópicamente {cite:p}`Rall2018What`.

source: Sliding filament model and length-tension relationship
es: Modelo de filamentos deslizantes y relación longitud-tensión

source: Sarcomeres contain a number of proteins, like titin, which acts as a "molecular spring" and is important for establishing elasticity and passive tension in muscles {cite:p}`granzier2006giant`. However, the basis for contraction lies in the interaction between actin (thin) filaments and myosin (thick) filaments {cite:p}`guyton2016book, openStax_contraction`. These filaments are arranged in parallel, with areas of overlap. Myosin can attach to actin via binding sites in the myosin head region, forming what is called a cross-bridge. When the head moves, this causes the filaments to slide past one another, increasing the area of overlap and shortening the sarcomere ({numref}`01-4`).
es: Los sarcómeros contienen una serie de proteínas, como la titina, que actúa como un "resorte molecular" y es importante para establecer elasticidad y tensión pasiva en los músculos {cite:p}`granzier2006giant`. Sin embargo, la base para la contracción radica en la interacción entre filamentos de actina (delgados) y filamentos de miosina (gruesos) {cite:p}`guyton2016book, openStax_contraction`. Estos filamentos están organizados en paralelo, con áreas de superposición. La miosina puede unirse a la actina a través de sitios de unión en la región de la cabeza de miosina, formando lo que se llama un puente cruzado. Cuando la cabeza se mueve, esto causa que los filamentos se deslicen uno junto al otro, aumentando el área de superposición y acortando el sarcómero ({numref}`01-4`).

source: Sliding filament model of muscle contraction. Top image shows sarcomere in relaxed muscle. Filaments have areas of overlap, but are not actively engaged. Bottom image shows sarcomere in contracted muscle. Myosin heads bind to actin filaments, moving inward toward the M-line, and slide to shorten the sarcomere. Image credit: Richfield, David (2014). "Medical gallery of David Richfield". WikiJournal of Medicine 1 (2). DOI:10.15347/wjm/2014.009. ISSN 2002-4436.
es: Modelo de filamentos deslizantes de la contracción muscular. La imagen superior muestra el sarcómero en músculo relajado. Los filamentos tienen áreas de superposición, pero no están activamente comprometidos. La imagen inferior muestra el sarcómero en músculo contraído. Las cabezas de miosina se unen a los filamentos de actina, moviéndose hacia adentro hacia la línea M, y se desliza para acortar el sarcómero. Crédito de imagen: Richfield, David (2014). "Medical gallery of David Richfield". WikiJournal of Medicine 1 (2). DOI:10.15347/wjm/2014.009. ISSN 2002-4436.

source: When this happens in multiple sarcomeres along the length of the myofibril, the myofibril shortens. If the same effect occurs in many myofibrils within many fascicles, the entire muscle shortens and produces a contraction. This description of the interaction of the myosin and actin filaments is called the sliding filament model of contraction {cite:p}`openStax_contraction, guyton2016book`. The steps by which the myosin and actin filaments engage, slide, disengage, and then reset is collectively called the cross-bridge cycle (discussed in more detail below).
es: Cuando esto ocurre en múltiples sarcómeros a lo largo de la miofibrilla, esta se acorta. Si el mismo efecto ocurre en muchas miofibrillas dentro de muchos fascículos, todo el músculo se acorta y produce una contracción. Esta descripción de la interacción entre los filamentos de miosina y actina se denomina modelo de filamento deslizante de contracción {cite:p}`openStax_contraction, guyton2016book`. Los pasos mediante los cuales los filamentos de miosina y actina se enganchan, deslizan, separan y luego se reestablecen se denominan en conjunto ciclo de puentes cruzados (tratado con más detalle a continuación).
