Repository: thessaly/emg-test
Catalog: locale/*/LC_MESSAGES/chapter-1.po
Languages: es

source: Electrode gel can be placed to improve conduction but is often not necessary, especially if the electrodes have strong glue to make good contact with the skin
es: Puede usarse gel para electrodos para mejorar la conducción, aunque no suele ser necesario, especialmente si los electrodos tienen un adhesivo fuerte que asegure buen contacto con la piel

source: To avoid noise artifacts, ensure that no clothing is touching the electrodes or brushing
es: Para evitar artefactos de ruido, asegúrate de que ninguna prenda toque los electrodos o esté rozando

source: against the cables during recording
es: los cables durante la grabación

source: Left: EMG setup with electrodes connected to Muscle SpikerBox. (Connection to computer or smartphone not shown.) Image credit: Backyard Brains, CC BY NC. Retrieved from: <a href="https://backyardbrains.com/products/muscle-spikerbox">https://backyardbrains.com/products/muscle-spikerbox</a>
es: Izquierda: Configuración del EMG con electrodos conectados a la Muscle SpikerBox. (La conexión con computadora o teléfono no se muestra.) Crédito de la imagen: Backyard Brains, CC BY NC. Fuente: <a href="https://backyardbrains.com/products/muscle-spikerbox">https://backyardbrains.com/products/muscle-spikerbox</a>

source: Test EMG recordings
es: Prueba las grabaciones de EMG

source: Turn on the Muscle SpikerBox by rotating the black wheel switch on the side, a green light should turn on; note that electrodes should be connected before turning on the device and disconnected only after the device is turned off to avoid a nasty feedback noise!
es: Enciende la Muscle SpikerBox girando la rueda negra en el lateral; debería encenderse una luz verde. Nota: los electrodos deben estar conectados antes de encender el dispositivo y deben desconectarse solo después de apagarlo para evitar un molesto ruido de retroalimentación.

source: Open the Spiker Recorder software and explore the controls and settings; for more info on software use, see {cite}`spikeRecorder`
es: Abre el software Spiker Recorder y explora los controles y configuraciones; para más información sobre el uso del software, consulta {cite}`spikeRecorder`

source: Snap your fingers near the recording device; if you see a corresponding artifact on the screen, this means you are recording only audio; to begin recording muscle activity, adjust the settings by pressing the ‘Config’ button and connecting to the indicated port
es: Chasquea los dedos cerca del dispositivo de grabación; si ves un artefacto correspondiente en la pantalla, significa que solo estás grabando audio. Para comenzar a registrar actividad muscular, ajusta la configuración presionando el botón ‘Config’ y conectándote al puerto indicado.

source: Ask the subject to briefly contract and relax the muscle of interest, and verify that electric potentials are observed during the contraction
es: Pídele al sujeto que contraiga y relaje brevemente el músculo de interés, y verifica que se observen potenciales eléctricos durante la contracción.

source: Check your signal to noise ratio; if the signal is too small, you can adjust the gain by turning the wheel switch to the right
es: Revisa la relación señal-ruido; si la señal es muy débil, puedes ajustar la ganancia girando la rueda hacia la derecha.

source: Try saving a recording to your computer or smartphone; format will be .wav, and is usually saved to a music folder or other place where audio files are stored
es: Intenta guardar una grabación en tu computadora o teléfono; el formato será .wav y usualmente se guarda en una carpeta de música u otra donde se almacenan archivos de audio.

source: Recording software interface. Image credit: Backyard Brains, CC BY NC. Retrieved from: <a href="https://help.backyardbrains.com/support/solutions/articles/43000607420-spike-recorder-for-pc-mac-linux">https://help.backyardbrains.com/support/solutions/articles/43000607420-spike-recorder-for-pc-mac-linux</a>
es: Interfaz del software de grabación. Crédito de la imagen: Backyard Brains, CC BY NC. Fuente: <a href="https://help.backyardbrains.com/support/solutions/articles/43000607420-spike-recorder-for-pc-mac-linux">https://help.backyardbrains.com/support/solutions/articles/43000607420-spike-recorder-for-pc-mac-linux</a>

source: Collect EMG data
es: Recolectar datos de EMG

source: Make sure device is ready to record and the volunteer is in a resting position
es: Asegúrate de que el dispositivo esté listo para grabar y que la persona voluntaria esté en posición de reposo.

source: Before the recording begins, have the volunteer think about the type of movement they need to make to activate the muscle of interest, e.g., for the gastrocnemius muscle, this will involved standing on tip toes, whereas for the splenius capitis, this will involve lifting the head
es: Antes de comenzar la grabación, pídele a la persona voluntaria que piense en el tipo de movimiento que debe hacer para activar el músculo de interés. Por ejemplo, para el gastrocnemio, esto implicará pararse de puntillas; para el splenius capitis, levantar la cabeza.

source: When the volunteer is ready, press record on the Spike Recorder interface
es: Cuando la persona esté lista, presiona ‘record’ en la interfaz del Spike Recorder

source: Instruct the volunteer to remain relaxed for a few seconds after the recording begins, then contract the muscle of interest for a few seconds, and then relax again for a few seconds
es: Indícale que permanezca relajada durante unos segundos después de comenzar la grabación, luego que contraiga el músculo de interés por unos segundos, y que después lo relaje nuevamente por unos segundos.

source: Have the volunteer repeat the above sequence at least 3 times so you can get various measures
es: Pídele que repita la secuencia anterior al menos 3 veces para poder obtener diferentes mediciones.

source: Terminate the recording and save the data to your computer, tablet, or phone; recordings should be saved and exported in .wav format for analysis
es: Termina la grabación y guarda los datos en tu computadora, tableta o teléfono; las grabaciones deben guardarse y exportarse en formato .wav para su análisis.

source: Start a new recording to examine the effects of contraction force on the EMG signal
es: Inicia una nueva grabación para examinar los efectos de la fuerza de contracción en la señal EMG

source: Instruct the subject to perform the first contraction with very little force, then pause, then perform and second contraction with greater force, then pause, and finally perform a third contraction with maximal force
es: Indica a la persona que realice una primera contracción con muy poca fuerza, luego haga una pausa; después una segunda contracción con mayor fuerza, pausa nuevamente; y finalmente una tercera contracción con fuerza máxima.

source: Terminate the recordings and save the data to your computer or smartphone
es: Termina las grabaciones y guarda los datos en tu computadora o teléfono

source: Start a new recording to examine the effects of fatigue on the EMG signal
es: Inicia una nueva grabación para examinar los efectos de la fatiga sobre la señal EMG

source: Instruct the subject to contract the muscle of interest and maintain the contraction for as long as they can; how long can they hold it? what happens as they start to tire? what happens if they use minimal versus maximal force?
es: Indica a la persona que contraiga el músculo de interés y mantenga la contracción el mayor tiempo posible. ¿Cuánto tiempo puede mantenerla? ¿Qué ocurre al comenzar a fatigarse? ¿Qué diferencias observas entre fuerza mínima y fuerza máxima?

source: Terminate the recording and save the data to your computer, tablet, or phone
es: Termina la grabación y guarda los datos en tu computadora, tableta o teléfono

source: Repeat the above for each muscle belonging to the three lever systems types; subjects should rest for a few minutes between recordings
es: Repite lo anterior para cada músculo correspondiente a los tres tipos de sistema de palancas; las personas deben descansar unos minutos entre grabaciones

source: Remember to label your data so you know to which subject, muscle, and experiment type each recording belongs
es: Recuerda etiquetar tus datos para saber a qué persona, músculo y tipo de experimento pertenece cada grabación

source: References
es: Referencias
