Repository: thessaly/emg-test
Catalog: locale/*/LC_MESSAGES/chapter-1.po
Languages: es

source: There is an optimal, intermediary level of filament overlap that produces maximal tension in the muscle {cite:p}`guyton2016book, openStax_neuro`. Too little overlap and the filaments cannot bind and interact; too much overlap and there is no capacity for additional filament sliding. The relationship between filament overlap (i.e., the length of the sarcomere) and muscle tension is called the length-tension relationship, and is shown in {numref}`01-5`.
es: Existe un nivel intermedio óptimo de superposición de filamentos que produce una tensión máxima en el músculo {cite:p}`guyton2016book, openStax_neuro`. Muy poca superposición y los filamentos no pueden unirse ni interactuar; demasiada superposición y no hay capacidad para que se deslicen adicionalmente. La relación entre la superposición de filamentos (es decir, la longitud del sarcómero) y la tensión muscular se llama relación longitud-tensión, y se muestra en {numref}`01-5`.

source: Length-tension relationship in muscle. Maximal tension is produced when actin and myosin filaments have optimal overlap for sliding, i.e., at around 80-100% of the sarcomere’s resting length. Image credit: OpenStax, CC BY, <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension?query=length-tension&amp;target=%7B%22index%22%3A0%2C%22type%22%3A%22search%22%7D#fs-id2329081">https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension</a>
es: Relación longitud-tensión en el músculo. Se produce una tensión máxima cuando los filamentos de actina y miosina tienen una superposición óptima para deslizarse, es decir, alrededor del 80-100% de la longitud de reposo del sarcómero. Crédito de imagen: OpenStax, CC BY, <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension?query=length-tension&amp;target=%7B%22index%22%3A0%2C%22type%22%3A%22search%22%7D#fs-id2329081">https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension</a>

source: Excitation-contraction coupling and cross-bridge cycling
es: Acoplamiento excitación-contracción y ciclo de puentes cruzados

source: How does an action potential (AP) generated at the neuromuscular junction (NMJ)(Action potential generation at the NMJ is not discussed herein, but can be reviewed in Ch. 7 of Guyton & Hall.) lead to cross-bridge cycling within the sarcomeres? In other words, how is excitation coupled to contraction? The AP propagates from the NMJ down through the T-tubules to reach the interior of the myofibrils {cite:p}`openStax_contraction, guyton2016book`. Within the T-tubule, the change in voltage activates a voltage-gated calcium channel known as Ca~v~1.1, or the dihydropyridine receptor (DHPR) {cite:p}`schneider2012skeletal`. The DHPR is mechanically linked to the ryanodine receptor (RyR) embedded in the membrane of the sarcoplasmic reticulum (SR). Activation of DHPR causes a conformational change that, in turn, activates RyR, opening the channel and allowing calcium to exit the SR down its electrochemical gradient. This increase in free intracellular calcium, in turn, permits cross-bridge formation. If calcium is not present, cross-bridges cannot form because a complex of tropomyosin and troponin proteins blocks the myosin binding site on the actin filaments. When calcium binds with troponin, it results in a conformational change that moves tropomyosin out of the way and allows myosin and actin to bind. Once they are bound, the filaments can slide {cite:p}`schneider2012skeletal, openStax_contraction`.
es: ¿Cómo un potencial de acción (PA) generado en la unión neuromuscular (UNM) (la generación del potencial de acción en la UNM no se aborda aquí, pero puede revisarse en el Cap. 7 de Guyton & Hall) conduce al ciclo de puentes cruzados dentro de los sarcómeros? En otras palabras, ¿cómo se acopla la excitación a la contracción? El PA se propaga desde la UNM a través de los túbulos T para alcanzar el interior de las miofibrillas {cite:p}`openStax_contraction, guyton2016book`. Dentro del túbulo T, el cambio de voltaje activa un canal de calcio dependiente de voltaje conocido como Ca~v~1.1, o receptor de dihidropiridina (DHPR) {cite:p}`schneider2012skeletal`. El DHPR está mecánicamente vinculado al receptor de rianodina (RyR) incrustado en la membrana del retículo sarcoplásmico (RS). La activación del DHPR provoca un cambio conformacional que, a su vez, activa al RyR, abriendo el canal y permitiendo que el calcio salga del RS a favor de su gradiente electroquímico. Este aumento de calcio intracelular libre, a su vez, permite la formación de puentes cruzados. Si no hay calcio presente, no se pueden formar los puentes cruzados porque un complejo de proteínas de tropomiosina y troponina bloquea el sitio de unión a la miosina en los filamentos de actina. Cuando el calcio se une a la troponina, produce un cambio conformacional que desplaza a la tropomiosina y permite la unión entre miosina y actina. Una vez que están unidos, los filamentos pueden deslizarse {cite:p}`schneider2012skeletal, openStax_contraction`.

source: To continue cycling, the myosin and actin filaments must also be able to unbind and reset their position. This process requires the input of energy in the form of ATP {cite:p}`openStax_contraction, guyton2016book`. When myosin binds with ATP, it detaches from actin. Subsequently, the ATP is hydrolyzed and the energy released is used to move the myosin head back into the “cocked” position, ready to bind with actin. ADP and one inorganic phosphate remain attached to the myosin head. Then, myosin binds to actin and releases the inorganic phosphate. Next, the myosin head releases the ADP and moves inward in what is called the power stroke, which causes the actin filaments to slide toward the midline and shorten the sarcomere. Cross-bridge cycling continues as long as sufficient ATP and calcium are present. The muscle relaxes when calcium is pumped back into the SR and is no longer available, thereby allowing tropomyosin to block the actin-myosin binding site once more {cite:p}`openStax_contraction, guyton2016book`.
es: Para continuar el ciclo, los filamentos de miosina y actina también deben poder separarse y restablecer su posición. Este proceso requiere la entrada de energía en forma de ATP {cite:p}`openStax_contraction, guyton2016book`. Cuando la miosina se une al ATP, se desprende de la actina. Posteriormente, el ATP se hidroliza y la energía liberada se utiliza para mover la cabeza de miosina de regreso a la posición 'cargada', lista para unirse nuevamente a la actina. El ADP y un fosfato inorgánico permanecen unidos a la cabeza de miosina. Luego, la miosina se une a la actina y libera el fosfato inorgánico. A continuación, la cabeza de miosina libera el ADP y se mueve hacia el interior en lo que se llama golpe de fuerza, lo que provoca que los filamentos de actina se deslicen hacia la línea media y acorten el sarcómero. El ciclo de puentes cruzados continúa mientras haya suficiente ATP y calcio presentes. El músculo se relaja cuando el calcio es bombeado de nuevo al RS y ya no está disponible, lo que permite que la tropomiosina vuelva a bloquear el sitio de unión actina-miosina {cite:p}`openStax_contraction, guyton2016book`.

source: **Study question**: How do the molecular details of excitation-contraction coupling differ in cardiac and smooth muscle, compared to skeletal muscle?
es: **Pregunta de estudio**: ¿En qué se diferencian los detalles moleculares del acoplamiento excitación-contracción en el músculo cardíaco y el músculo liso, en comparación con el músculo esquelético?

source: Muscle fiber responses, summation, and recruitment
es: Respuestas de las fibras musculares, sumación y reclutamiento

source: The response of a muscle to stimulation depends on the timing and strength of the stimulus {cite:p}`schneider2012skeletal, openStax_neuro`. If only a brief stimulus occurs, then a muscle fiber will respond with a single AP and only a short (tens to hundreds of milliseconds) twitch will be produced. Because the intracellular events needed to produce a twitch take longer than those to generate an AP, another AP can arrive before the muscle fiber has fully relaxed. If this occurs, the second response will add to the tension already present in the muscle in a process called summation. Achieving sustained muscle fiber contraction and generating tension large enough to do work requires the summation of multiple stimulatory events {cite:p}`schneider2012skeletal, guyton2016book`.
es: La respuesta de un músculo a la estimulación depende del momento y la intensidad del estímulo {cite:p}`schneider2012skeletal, openStax_neuro`. Si solo ocurre un estímulo breve, la fibra muscular responderá con un único PA y se producirá solo una contracción breve (de decenas a cientos de milisegundos). Debido a que los eventos intracelulares necesarios para producir una contracción tardan más que los que generan un PA, puede llegar otro PA antes de que la fibra muscular se haya relajado por completo. Si esto ocurre, la segunda respuesta se sumará a la tensión ya presente en el músculo, en un proceso llamado sumación. Para lograr una contracción sostenida de la fibra muscular y generar una tensión lo suficientemente grande como para realizar trabajo, se requiere la sumación de múltiples eventos estimulantes {cite:p}`schneider2012skeletal, guyton2016book`.

source: In addition to summation within single muscles fibers, multiple fibers are activated to achieve whole-muscle contraction. A motor neuron and all the muscle fibers it sends signals to (innervates) within a muscle is called a motor unit. Motor units can vary in size, with some motor neurons innervating few fibers (small unit) and others innervating many (large unit). Muscles can vary the force they generate depending on the number and type of motor units that are recruited {cite:p}`openStax_neuro`.
es: Además de la sumación dentro de fibras musculares individuales, se activan múltiples fibras para lograr la contracción del músculo completo. Una neurona motora y todas las fibras musculares a las que envía señales (inerva) dentro de un músculo se llaman unidad motora. Las unidades motoras pueden variar en tamaño, algunas neuronas motoras inervan pocas fibras (unidad pequeña) y otras inervan muchas (unidad grande). Los músculos pueden variar la fuerza que generan dependiendo del número y tipo de unidades motoras que se reclutan {cite:p}`openStax_neuro`.

source: Muscle responses. <em>Left</em>: Myogram showing tension developed during a muscle fiber twitch resulting from a single, brief stimulus. <em>Right</em>: Multiple stimuli delivered in quick succession produce summation and increasing tension. If stimulation frequency is high enough, the responses fuse into tetanus. Maximal tension and a smooth contraction is achieved. Image credit: Open Stax, CC BY, <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension">https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension</a>
es: Respuestas musculares. <em>Izquierda</em>: Miograma que muestra la tensión desarrollada durante una contracción breve de una fibra muscular producida por un solo estímulo breve. <em>Derecha</em>: Estímulos múltiples aplicados en rápida sucesión producen sumación y aumento de la tensión. Si la frecuencia de estimulación es lo suficientemente alta, las respuestas se fusionan en un tétanos. Se logra una tensión máxima y una contracción suave. Crédito de imagen: Open Stax, CC BY, <a href="https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension">https://openstax.org/books/anatomy-and-physiology/pages/10-4-nervous-system-control-of-muscle-tension</a>

source: Measuring electrical activity of skeletal muscles - electromyogram
es: Medición de la actividad eléctrica de los músculos esqueléticos - electromiograma

source: To record the electrical activity of muscles we use a technique called electromyography, and the recordings we obtain are called electromyograms (EMGs) {cite:p}`garcia2011surface`. EMG recording can be done invasively by inserting electrodes into the muscle of interest, or non-invasively by using surface electrodes placed on the skin above the muscle. Electrode insertion has the advantage of giving ‘cleaner’ EMG recordings in which the activity of separate motor units can be distinguished. However, electrode insertion can be painful and requires sterile conditions to prevent infection, making this type of recording not ideal for classroom settings. Surface electrodes, in contrast, can be easily applied to and removed from the skin without injury. The limitations of this type of extracellular recording include only being able to record from superficial muscles, and recordings which often do not allow for the separation of individual motor units {cite:p}`garcia2011surface`. These limitations are not prohibitive and are typically outweighed by the benefits of non-invasiveness, but should be kept in mind when thinking about electrode placement and data analysis.
es: Para registrar la actividad eléctrica de los músculos se utiliza una técnica llamada electromiografía, y las grabaciones obtenidas se denominan electromiogramas (EMG) {cite:p}`garcia2011surface`. La EMG puede realizarse de forma invasiva, insertando electrodos en el músculo de interés, o de forma no invasiva, utilizando electrodos de superficie colocados sobre la piel que recubre el músculo. Insertar los electrodos permite obtener grabaciones de EMG más limpias, donde puede distinguirse la actividad de unidades motoras individuales. Sin embargo, la inserción puede ser dolorosa y requiere condiciones estériles para evitar infecciones, por lo que no es ideal para contextos educativos. En cambio, los electrodos de superficie pueden colocarse y retirarse fácilmente sin causar daño. Las limitaciones de este tipo de registro extracelular incluyen que solo puede medirse la actividad de músculos superficiales y que no siempre es posible distinguir unidades motoras individuales {cite:p}`garcia2011surface`. Estas limitaciones no son prohibitivas y suelen compensarse con los beneficios de la no invasividad, aunque deben tenerse en cuenta al decidir dónde colocar los electrodos y cómo analizar los datos.

source: One of the most common recording configurations is known as a bipolar EMG, or a single differential EMG {cite:p}`garcia2011surface`. Two surface electrodes are placed on the skin above the muscle just a few centimeters apart {numref}`01-7`. By subtracting the signals recorded at the two points and then amplifying the difference, common signals that may result from muscles outside the recording site are largely excluded, and predominantly local changes in activity are recorded. This configuration thereby decreases muscle cross-talk {cite:p}`garcia2011surface`.
es: Una de las configuraciones de registro más comunes se denomina EMG bipolar, o EMG diferencial simple {cite:p}`garcia2011surface`. Se colocan dos electrodos de superficie sobre la piel, encima del músculo de interés, separados solo por unos pocos centímetros {numref}`01-7`. Al restar las señales registradas en ambos puntos y amplificar la diferencia, se excluyen en gran medida las señales comunes que podrían provenir de otros músculos fuera del área de registro, registrándose principalmente cambios locales en la actividad. Esta configuración reduce la interferencia entre músculos {cite:p}`garcia2011surface`.

source: Bipolar EMG recording setup. For simplicity, not all body or recording components are shown. Image credit: Erin C. McKiernan, CC BY, based on a figure from <span class="citation" data-cites="garcia2011surface"></span>.
es: Configuración de registro EMG bipolar. Por simplicidad, no se muestran todos los componentes del cuerpo ni del sistema de registro. Crédito de la imagen: Erin C. McKiernan, CC BY, basado en una figura de <span class="citation" data-cites="garcia2011surface"></span>.

source: Bipolar surface EMGs can tell us several things about muscle activity {cite:p}`garcia2011surface`. One is the timing of muscle activation and relaxation. Most muscles show very little activity at rest. When activated, we see a noticeable increase in the occurrence of electrical impulses, as shown in Figure <a href="#ol35g72GqC" data-reference-type="ref" data-reference="ol35g72GqC">7</a>, right-hand side. When the muscle relaxes, these impulses disappear and only the baseline noise is recorded. The timing of muscle activity can then be correlated with other measures. We can also, to some extent, estimate the force or effort exerted during a contraction. As the subject increases the force of contraction, we see an increase in both the frequency of electrical impulses and the signal amplitude. These changes result from two factors: (1) a higher frequency of firing in already active motor units, and (2) the recruitment of additional motor units. Remember, we are recording the activity of multiple motor units. With increasing contraction force, more motor units are recruited and begin to fire, their activity sums, and contributes to the frequency and amplitude increases.
es: Los EMG bipolares de superficie pueden informarnos sobre varios aspectos de la actividad muscular {cite:p}`garcia2011surface`. Uno de ellos es el momento en que se activa o relaja el músculo. La mayoría de los músculos muestran muy poca actividad en reposo. Cuando se activan, se observa un aumento notable en la aparición de impulsos eléctricos, como se muestra en la Figura <a href="#ol35g72GqC" data-reference-type="ref" data-reference="ol35g72GqC">7</a>, lado derecho. Cuando el músculo se relaja, estos impulsos desaparecen y solo se registra el ruido de base. El momento de la actividad muscular puede correlacionarse con otras mediciones. También podemos estimar, hasta cierto punto, la fuerza o el esfuerzo ejercido durante una contracción. A medida que el sujeto aumenta la fuerza de la contracción, se observa un aumento tanto en la frecuencia de los impulsos eléctricos como en la amplitud de la señal. Estos cambios se deben a dos factores: (1) una mayor frecuencia de disparo en las unidades motoras ya activas, y (2) el reclutamiento de unidades motoras adicionales. Recuerda que se está registrando la actividad de múltiples unidades motoras. Con una mayor fuerza de contracción, se reclutan más unidades motoras que comienzan a activarse, y su actividad se suma, contribuyendo al aumento de frecuencia y amplitud.

source: Study questions
es: Preguntas de estudio

source: Where will you need to place the electrodes to record EMGs from a class 1, class 2, or class 3 lever system?
es: ¿Dónde deberás colocar los electrodos para registrar EMGs de un sistema de palanca de clase 1, clase 2 o clase 3?

source: Will you be able to record from any muscle you want in each lever system? Why, or why not?
es: ¿Podrás registrar desde cualquier músculo que desees en cada sistema de palanca? ¿Por qué sí o por qué no?

source: How will you know if you have correctly placed the electrodes? What could you do to verify this?
es: ¿Cómo sabrás si colocaste correctamente los electrodos? ¿Qué podrías hacer para verificarlo?

source: Experimental protocol
es: Protocolo experimental

source: Before beginning, make sure you have all the necessary equipment and have installed the [Backyard Brains Spike Recorder software](https://backyardbrains.com/products/byb-spike-recorder) on your computer or smartphone. The following steps will guide you in setting up the equipment and carrying out recordings.
es: Antes de comenzar, asegúrate de tener todo el equipo necesario y de haber instalado el [software Backyard Brains Spike Recorder](https://backyardbrains.com/products/byb-spike-recorder) en tu computadora o teléfono. Los siguientes pasos te guiarán para configurar el equipo y realizar las grabaciones.

source: Set up EMG recordings
es: Configura las grabaciones de EMG

source: The [Backyard Brains Muscle SpikerBox](https://backyardbrains.com/products/muscle-spikerbox) comes fully assembled and ready to record. All you have to do is connect the battery, cables, and electrodes.
es: La [Muscle SpikerBox de Backyard Brains](https://backyardbrains.com/products/muscle-spikerbox) viene completamente ensamblada y lista para grabar. Solo tienes que conectar la batería, los cables y los electrodos.

source: Connect the 9V battery to its terminals on the Muscle SpikerBox
es: Conecta la batería de 9V a sus terminales en la Muscle SpikerBox

source: Connect the black/blue or green cable to the corresponding computer, tablet, or phone port on the Muscle SpikerBox; note that the smartphone cable is directional and labeled, so make sure you have the correct end inserted into the device
es: Conecta el cable negro/azul o verde al puerto correspondiente en la Muscle SpikerBox para computadora, tableta o teléfono; ten en cuenta que el cable para smartphone es direccional y está etiquetado, así que asegúrate de insertar el extremo correcto en el dispositivo

source: Connect the other end of the black/blue or green cable to your computer, tablet, or phone
es: Conecta el otro extremo del cable negro/azul o verde a tu computadora, tableta o teléfono

source: Connect the orange cable to its corresponding port on the Muscle SpikerBox
es: Conecta el cable naranja a su puerto correspondiente en la Muscle SpikerBox

source: Place the surface electrodes over the muscle of interest, just a few centimeters apart and oriented parallel to the muscle fibers; remember that to record each lever type, you will have to change the electrode placement between experiments
es: Coloca los electrodos de superficie sobre el músculo de interés, separados por solo unos centímetros y orientados en paralelo a las fibras musculares; recuerda que para registrar cada tipo de palanca, deberás cambiar la colocación de los electrodos entre experimentos

source: Class 1 lever - example muscle of interest: splenius capitis
es: Palanca de clase 1 – músculo de interés: splenius capitis

source: Class 2 lever - example muscle of interest: gastrocnemius
es: Palanca de clase 2 – músculo de interés: gastrocnemio

source: Class 3 lever - example muscle of interest: biceps brachii
es: Palanca de clase 3 – músculo de interés: bíceps braquial

source: Connect each of the red alligator clips on the end of the orange cable to one of the muscle surface electrodes; make sure the metal clips do not touch and try to avoid entangling the cables
es: Conecta cada una de las pinzas tipo caimán rojas del extremo del cable naranja a uno de los electrodos de superficie; asegúrate de que las partes metálicas no se toquen entre sí y trata de evitar que los cables se enreden

source: Hold the black alligator clip (reference) in your hand, or connect it to another surface electrode on the back of your hand or some other area away from the recording site, e.g. over a bone
es: Sostén la pinza negra tipo caimán (referencia) en tu mano, o conéctala a otro electrodo de superficie en el dorso de la mano o alguna otra zona alejada del sitio de registro, por ejemplo sobre un hueso

source: To improve the EMG signal, the area where the electrodes will be placed can be cleaned with alcohol prior to placement; wait until the area is dry to place the electrode
es: Para mejorar la señal de EMG, puede limpiarse con alcohol la zona donde se colocarán los electrodos; espera a que se seque completamente antes de colocarlos
