Repository: thessaly/emg-test
Catalog: locale/*/LC_MESSAGES/chapter-2.po
Languages: es

source: <mark>Analysis practical</mark>
es: <mark>Práctica de análisis</mark>

source: Ch. 2: Graphing and visually exploring EMG data
es: Cap. 2: Graficación y exploración visual de datos EMG

source: **Authors:** Erin McKiernan (1,2), Ana Daniela del Rio Pulido(1), Noel Isaias Plascencia Diaz(1), Mitsui Myrna Salgado Saito(1) **Affiliation:** (1) Universidad Nacional Autónoma de México (UNAM), (2) Open Research Community Accelerator (ORCA) **Date:** February 16, 2025
es: **Autores:** Erin McKiernan (1,2), Ana Daniela del Rio Pulido(1), Noel Isaias Plascencia Diaz(1), Mitsui Myrna Salgado Saito(1) **Afiliación:** (1) Universidad Nacional Autónoma de México (UNAM), (2) Open Research Community Accelerator (ORCA) **Fecha:** 16 de febrero de 2025

source: Overview
es: Resumen

source: The objective of this data analysis practical is to graph and explore EMG recordings made from different skeletal muscles during various physical activities. The recordings visualized below can be found in our GitHub repository (<https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data>), or new recordings can be obtained by performing the experimental practical in [Ch. 1: Muscle physiology and EMG basics](oxa:EPpXta8zJdzN048lz8AR/hZTnTYzQR5EQmCKX51Wj "Ch. 1: Muscle physiology and EMG basics "). The duration of this practical could vary depending on the programming experience of students and the goals of the class. This practical could be carried out in multiple sessions, especially if students are asked to first record EMGs and then graph their own recordings. Or, since this is an analysis practical, it could be done asynchronously as an assigned homework.
es: El objetivo de esta práctica de análisis de datos es graficar y explorar registros EMG realizados en diferentes músculos esqueléticos durante varias actividades físicas. Las grabaciones que se visualizan a continuación se pueden encontrar en nuestro repositorio de GitHub (<https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data>), o se pueden obtener nuevas grabaciones realizando la práctica experimental en [Cap. 1: Fisiología muscular y conceptos básicos de EMG](oxa:EPpXta8zJdzN048lz8AR/hZTnTYzQR5EQmCKX51Wj "Cap. 1: Fisiología muscular y conceptos básicos de EMG"). La duración de esta práctica podría variar dependiendo de la experiencia en programación de los estudiantes y los objetivos de la clase. Esta práctica podría realizarse en múltiples sesiones, especialmente si se les pide a los estudiantes que primero registren EMG y luego grafiquen sus propias grabaciones. O, dado que se trata de una práctica de análisis, podría realizarse de forma asincrónica como tarea asignada.

source: Setting up the notebook
es: Configuración del cuaderno

source: We begin by setting up the Jupyter notebook and importing the Python modules for plotting figures. We include commands to view plots in the notebook, and to create figures with good resolution and large labels.
es: Comenzamos configurando el cuaderno Jupyter e importando los módulos de Python para trazar figuras. Incluimos comandos para ver gráficos en el cuaderno y para crear figuras con buena resolución y etiquetas grandes.

source: # command to view figures in Jupyter notebook %matplotlib inline # import plotting module import matplotlib.pyplot as plt # commands to create high-resolution figures with large labels %config InlineBackend.figure_formats = {'png', 'retina'} plt.rcParams['axes.labelsize'] = 18 # fontsize for figure labels plt.rcParams['axes.titlesize'] = 20 # fontsize for figure titles plt.rcParams['font.size'] = 16 # fontsize for figure numbers plt.rcParams['lines.linewidth'] = 1.6 # line width for plotting
es: # comando para ver figuras en el cuaderno Jupyter %matplotlib inline # importar módulo de graficación import matplotlib.pyplot as plt # comandos para crear figuras de alta resolución con etiquetas grandes %config InlineBackend.figure_formats = {'png', 'retina'} plt.rcParams['axes.labelsize'] = 18 # tamaño de fuente para etiquetas plt.rcParams['axes.titlesize'] = 20 # tamaño de fuente para títulos plt.rcParams['font.size'] = 16 # tamaño de fuente para números plt.rcParams['lines.linewidth'] = 1.6 # ancho de línea para graficar

source: Next, we import various modules for extracting data and scientific computing.
es: A continuación, importamos varios módulos para extraer datos y computación científica.

source: The following cell makes a copy of the necessary data files for this lesson from repository [https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data](https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data)
es: La siguiente celda hace una copia de los archivos de datos necesarios para esta lección del repositorio [https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data](https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data)

source: Extracting and graphing the data
es: Extracción y graficación de los datos

source: EMG recordings were obtained using the Backyard Brains Muscle SpikerBox, and are saved as audio files in .wav format. So, we first have to open the .wav files and extract the data. We can also extract the number of recording channels and sampling rate.
es: Las grabaciones EMG se obtuvieron utilizando el Muscle SpikerBox de Backyard Brains y se guardan como archivos de audio en formato .wav. Por lo tanto, primero debemos abrir los archivos .wav y extraer los datos. También podemos extraer el número de canales de grabación y la frecuencia de muestreo.

source: The recording has 1 channel(s). The sampling rate of the recording is 44100 Hz.
es: La grabación tiene 1 canal(es). La frecuencia de muestreo de la grabación es de 44100 Hz.

source: Now, let's plot the EMG. The following recording was made from the calf muscle during repeated calf raises.
es: Ahora, grafiquemos el EMG. La siguiente grabación se realizó en el músculo de la pantorrilla durante elevaciones repetidas de talón.

source: plt.figure(figsize=(18,6)) plt.xlabel(r'time (s)') plt.ylabel(r'voltage ($\mu$V)') plt.plot(timeEMG,waveData, 'b') plt.xlim(0,max(timeEMG));
es: plt.figure(figsize=(18,6)) plt.xlabel(r'tiempo (s)') plt.ylabel(r'voltaje ($\mu$V)') plt.plot(timeEMG,waveData, 'b') plt.xlim(0,max(timeEMG));

source: We can define a function to allow us to quickly extract and graph different EMG recordings. The input to the function is the name of the file we want to analyze.
es: Podemos definir una función que nos permita extraer y graficar rápidamente diferentes grabaciones EMG. La entrada de la función es el nombre del archivo que queremos analizar.

source: Exploring the activity of different muscles
es: Explorando la actividad de diferentes músculos

source: Using our function, we can now dive into our repository of recordings and look at the EMGs of different muscles recorded during various physical activities.
es: Usando nuestra función, ahora podemos sumergirnos en nuestro repositorio de grabaciones y observar los EMG de diferentes músculos registrados durante varias actividades físicas.

source: Biceps muscle
es: Músculo bíceps

source: The following EMG was recorded from the biceps muscle during repeated (3) contractions with intermittent rest periods.
es: El siguiente EMG se registró en el músculo bíceps durante contracciones repetidas (3) con períodos de descanso intermitentes.

source: The following EMG was recorded from the biceps as the subject sustained a contraction and gradually increased the amount of force (i.e., recruitment).
es: El siguiente EMG se registró en el bíceps mientras el sujeto mantenía una contracción y aumentaba gradualmente la cantidad de fuerza (es decir, reclutamiento).

source: Study questions and exercises:
es: Preguntas de estudio y ejercicios:

source: How do the recordings differ when we look at intermittent versus sustained muscle contractions?
es: ¿En qué se diferencian las grabaciones cuando observamos contracciones musculares intermitentes versus sostenidas?

source: Which features of the EMG recording change as the subject increases the force of contraction, and how? In other words, how might we quantify motor unit recruitment?
es: ¿Qué características del registro EMG cambian a medida que el sujeto aumenta la fuerza de contracción y cómo? En otras palabras, ¿cómo podríamos cuantificar el reclutamiento de unidades motoras?

source: What other exercises could you carry out while recording from the biceps muscle, and how would you expect the EMG recordings to look?
es: ¿Qué otros ejercicios podrías realizar mientras grabas el músculo bíceps y cómo esperarías que se vean los registros EMG?

source: If you have recording equipment available, record from your own biceps muscle and then extract and graph your data.
es: Si tienes equipo de grabación disponible, graba tu propio músculo bíceps y luego extrae y grafica tus datos.

source: Triceps muscle
es: Músculo tríceps

source: The following recording was made from the triceps muscle while the subject performed triceps dips.
es: La siguiente grabación se realizó en el músculo tríceps mientras el sujeto realizaba flexiones de tríceps.

source: This next recording is more complex. It was made from the triceps muscle and included the following sequence of activities: (1) for the first 10 seconds, the subject was at rest, (2) then for the following 10 seconds, the subject turned their arm to activate the triceps isometrically, (3) then the subject changed position, and (4) finally, during the last 20 seconds, the subject repeatedly lifted and lowered a bottle with water inside (i.e., similar to an overhead triceps extension).
es: La siguiente grabación es más compleja. Se realizó en el músculo tríceps e incluyó la siguiente secuencia de actividades: (1) durante los primeros 10 segundos, el sujeto estaba en reposo, (2) luego, durante los siguientes 10 segundos, el sujeto giró el brazo para activar el tríceps de forma isométrica, (3) luego el sujeto cambió de posición y (4) finalmente, durante los últimos 20 segundos, el sujeto levantó y bajó repetidamente una botella con agua (similar a una extensión de tríceps por encima de la cabeza).

source: Why do you think the triceps dip recording shows a high level of continuous activity despite the fact that the dips involve an up-and-down movement?
es: ¿Por qué crees que la grabación de flexiones de tríceps muestra un alto nivel de actividad continua a pesar de que las flexiones implican un movimiento de arriba hacia abajo?

source: How is the triceps dip activity different from the repeated triceps extension at the end of the second recording, and why?
es: ¿En qué se diferencia la actividad de flexión de tríceps de la extensión repetida de tríceps al final de la segunda grabación y por qué?

source: What other exercises could you carry out while recording from the triceps muscle, and how would you expect the EMG recordings to look?
es: ¿Qué otros ejercicios podrías realizar mientras grabas el músculo tríceps y cómo esperarías que se vean los registros EMG?

source: If you have recording equipment available, record from your own triceps muscle and then extract and graph your data.
es: Si tienes equipo de grabación disponible, graba tu propio músculo tríceps y luego extrae y grafica tus datos.

source: Forearm muscles
es: Músculos del antebrazo

source: The following recording was made from the forearm while the subject repeatedly pressed a hand gripper exercise device. It shows five contractions in total, with the last one sustained for a longer period of time than the previous four.
es: La siguiente grabación se realizó en el antebrazo mientras el sujeto presionaba repetidamente un dispositivo de ejercicio de agarre manual. Muestra cinco contracciones en total, siendo la última sostenida durante más tiempo que las cuatro anteriores.

source: The next recording was made from the forearm while the subject participated in an arm wrestling match. Around second 14, the subject lost the match.
es: La siguiente grabación se realizó en el antebrazo mientras el sujeto participaba en un combate de pulseadas. Alrededor del segundo 14, el sujeto perdió el combate.

source: What muscles are found in the forearm, and which could be contributing to the EMG signal?
es: ¿Qué músculos se encuentran en el antebrazo y cuáles podrían estar contribuyendo a la señal EMG?

source: What other muscles, besides those in the forearm, might be activated during an arm wrestling match? Would you expect to see differences in their EMGs during this activity?
es: ¿Qué otros músculos, además de los del antebrazo, podrían activarse durante un combate de pulseadas? ¿Esperarías ver diferencias en sus EMG durante esta actividad?

source: What other exercises could you carry out while recording from the forearm muscles, and how would you expect the EMG recordings to look?
es: ¿Qué otros ejercicios podrías realizar mientras grabas los músculos del antebrazo y cómo esperarías que se vean los registros EMG?

source: If you have recording equipment available, record from your own forearm and then extract and graph your data.
es: Si tienes equipo de grabación disponible, graba tu propio antebrazo y luego extrae y grafica tus datos.

source: Jaw muscles
es: Músculos de la mandíbula

source: The following EMG was recorded from the jaw muscles. For the first 50 seconds, the subject chewed a soft, gummy candy. Then there were 10 seconds of rest. And finally, for the last ten seconds the subject made a forced smile.
es: El siguiente EMG se registró en los músculos de la mandíbula. Durante los primeros 50 segundos, el sujeto masticó un caramelo blando y gomoso. Luego hubo 10 segundos de descanso. Y finalmente, durante los últimos diez segundos, el sujeto hizo una sonrisa forzada.

source: Which muscles control chewing and smiling, and which could be contributing to the EMG signal?
es: ¿Qué músculos controlan la masticación y la sonrisa, y cuáles podrían estar contribuyendo a la señal EMG?

source: What differences do you see in the EMGs recorded when the subject is chewing versus smiling, and what do you think causes these differences?
es: ¿Qué diferencias observas en los EMG registrados cuando el sujeto mastica versus cuando sonríe, y qué crees que causa estas diferencias?

source: What other activities could you carry out while recording from the jaw or other facial muscles, and how would you expect the EMG recordings to look?
es: ¿Qué otras actividades podrías realizar mientras grabas la mandíbula u otros músculos faciales, y cómo esperarías que se vean los registros EMG?

source: If you have recording equipment available, record from your own jaw muscles; try experimenting with different electrode placements on the face, and then extract and graph your data
es: Si tienes equipo de grabación disponible, graba tus propios músculos de la mandíbula; intenta experimentar con diferentes colocaciones de electrodos en la cara y luego extrae y grafica tus datos

source: Abdominal muscles
es: Músculos abdominales

source: The following EMG recording was made from the abdominal muscles, specifically rectus abdominis, during lying leg raises.
es: La siguiente grabación EMG se realizó en los músculos abdominales, específicamente en el recto abdominal, durante elevaciones de piernas en decúbito supino.

source: The recording has 1 channel(s). The sampling rate of the recording is 10000 Hz.
es: La grabación tiene 1 canal(es). La frecuencia de muestreo de la grabación es de 10000 Hz.

source: During the next recording, the subject performed a sustained plank.
es: Durante la siguiente grabación, el sujeto realizó una plancha sostenida.

source: What do you think would happen to the EMG recordings if the subject performed more lying leg raises, or tried to hold the plank for longer? In other words, how might fatigue show up on the two recordings?
es: ¿Qué crees que sucedería con los registros EMG si el sujeto realizara más elevaciones de piernas en decúbito supino o intentara mantener la plancha durante más tiempo? En otras palabras, ¿cómo podría manifestarse la fatiga en las dos grabaciones?

source: How could we quantify fatigue, and how might the quantification be different for the two types of exercise?
es: ¿Cómo podríamos cuantificar la fatiga y en qué podría diferir la cuantificación para los dos tipos de ejercicio?

source: What other exercises could you do to activate the abdominal muscles, or which other ab muscles could you record from, and how would you expect the EMG recordings to look?
es: ¿Qué otros ejercicios podrías hacer para activar los músculos abdominales o qué otros músculos abdominales podrías grabar, y cómo esperarías que se vean los registros EMG?

source: If you have recording equipment available, record from your own abdominal muscles, try experimenting with different electrode placements and exercises, and then extract and graph your data.
es: Si tienes equipo de grabación disponible, graba tus propios músculos abdominales, intenta experimentar con diferentes colocaciones de electrodos y ejercicios, y luego extrae y grafica tus datos.

source: Quadriceps muscles
es: Músculos cuádriceps

source: The following EMG was recorded from the quadriceps muscles while the subject performed a one-legged squat, also known as a Bulgarian squat. The subject also had a backpack filled with books on during the exercise for added weight.
es: El siguiente EMG se registró en los músculos cuádriceps mientras el sujeto realizaba una sentadilla a una pierna, también conocida como sentadilla búlgara. El sujeto también llevaba una mochila llena de libros durante el ejercicio para agregar peso.

source: In the next recording, the subject sustained a wall squat, maintaining the backpack on top of the legs for added weight.
es: En la siguiente grabación, el sujeto mantuvo una sentadilla contra la pared, manteniendo la mochila sobre las piernas para agregar peso.

source: What muscles make up the quadriceps group, and which could be contributing to the EMG signal?
es: ¿Qué músculos componen el grupo de los cuádriceps y cuáles podrían estar contribuyendo a la señal EMG?

source: What factors could explain the fluctuations seen in the two recordings? What might have caused the increased amplitude at the end of the wall squat recording?
es: ¿Qué factores podrían explicar las fluctuaciones observadas en las dos grabaciones? ¿Qué podría haber causado el aumento de amplitud al final de la grabación de la sentadilla contra la pared?

source: What other exercises could you perform while recording from the quadriceps muscles, and how would you expect the EMG recordings to look?
es: ¿Qué otros ejercicios podrías realizar mientras grabas los músculos cuádriceps y cómo esperarías que se vean los registros EMG?

source: If you have recording equipment available, record from your own quadriceps, try experimenting with different electrode placements, and then extract and graph your data.
es: Si tienes equipo de grabación disponible, graba tus propios cuádriceps, intenta experimentar con diferentes colocaciones de electrodos y luego extrae y grafica tus datos.

source: You can explore more recordings from [our repository](https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data). Or, record your own EMGs and experiment with electrode placement and different exercises to see how it affects the signal.
es: Puedes explorar más grabaciones de [nuestro repositorio](https://github.com/emckiernan/electrophys/tree/master/EMG/EMGbasics/data). O graba tus propios EMG y experimenta con la colocación de electrodos y diferentes ejercicios para ver cómo afecta la señal.
