Repository: thessaly/emg-test
Catalog: locale/*/LC_MESSAGES/README.po
Languages: es

source: Jupyter Book User Guide
es: Guía del usuario de Jupyter Book

source: This guide will help you create, modify, and work with lessons in this Jupyter Book project.
es: Esta guía le ayudará a crear, modificar y trabajar con las lecciones en este proyecto de Jupyter Book.

source: Overview
es: Descripción general

source: This Jupyter Book automatically builds and publishes when you make changes to the source files. The book supports both Markdown (`.md`) and Jupyter Notebook (`.ipynb`) formats for lessons.
es: Este Jupyter Book se compila y publica automáticamente cuando realiza cambios en los archivos fuente. El libro admite tanto Markdown (`.md`) como Jupyter Notebook (`.ipynb`) para las lecciones.

source: Getting Started
es: Primeros pasos

source: Repository Structure
es: Estructura del repositorio

source: your-repo/ ├── images/ # All images for the book ├── _config.yml # Book configuration ├── _toc.yml # Table of contents ├── *.md # Markdown lesson files ├── *.ipynb # Jupyter notebook lesson files └── bibliography.bib # Citation references
es: your-repo/ ├── images/ # Todas las imágenes del libro ├── _config.yml # Configuración del libro ├── _toc.yml # Tabla de contenidos ├── *.md # Archivos de lecciones en Markdown ├── *.ipynb # Archivos de lecciones en Jupyter Notebook └── bibliography.bib # Referencias bibliográficas

source: Creating New Lessons
es: Creación de nuevas lecciones

source: Step 1: Choose Your Format
es: Paso 1: Elija su formato

source: **Markdown files (`.md`)**: Best for text-heavy lessons with static content
es: **Archivos Markdown (`.md`):** Ideales para lecciones con mucho texto y contenido estático

source: **Jupyter Notebooks (`.ipynb`)**: Best for interactive lessons with code examples
es: **Jupyter Notebooks (`.ipynb`):** Ideales para lecciones interactivas con ejemplos de código

source: Step 2: Create the Lesson File
es: Paso 2: Cree el archivo de la lección

source: Create a new file in the root directory
es: Cree un archivo nuevo en el directorio raíz

source: Name it descriptively (e.g., `chapter-01-levers.md` or `lab-02-forces.ipynb`)
es: Asígnelo un nombre descriptivo (por ejemplo, `chapter-01-levers.md` o `lab-02-forces.ipynb`)

source: Add it to the `_toc.yml` file in the appropriate location
es: Añádalo al archivo `_toc.yml` en la ubicación correspondiente

source: Step 3: Add Required Chapter Information
es: Paso 3: Agregue la información requerida del capítulo

source: Every lesson must start with author information:
es: Cada lección debe comenzar con la información del autor:

source: Step 4: Add Lesson Type Tag
es: Paso 4: Agregue la etiqueta de tipo de lección

source: Include a lesson type indicator:
es: Incluya un indicador de tipo de lección:

source: <mark>Lesson Type</mark>
es: <mark>Tipo de lección</mark>

source: Examples: `<mark>Analytical practical</mark>`, `<mark>Theory</mark>`, `<mark>Lab Exercise</mark>`
es: Ejemplos: `<mark>Práctica analítica</mark>`, `<mark>Teoría</mark>`, `<mark>Ejercicio de laboratorio</mark>`

source: Modifying Existing Lessons
es: Modificación de lecciones existentes

source: **Find the lesson file**: Look for `.md` or `.ipynb` files in the root directory
es: **Encuentre el archivo de la lección**: Busque archivos `.md` o `.ipynb` en el directorio raíz

source: **Edit the content**: Make your changes using the formatting guidelines below
es: **Edite el contenido**: Haga sus cambios siguiendo las pautas de formato a continuación

source: **Save and push**: The book will automatically rebuild via GitHub Actions
es: **Guarde y envíe**: El libro se volverá a compilar automáticamente a través de GitHub Actions

source: Content Formatting Guide
es: Guía de formato de contenido

source: Citations
es: Citas

source: **Single citation:**
es: **Cita única:**

source: **Multiple citations:**
es: **Múltiples citas:**

source: Images
es: Imágenes

source: Store all images in the `images/` folder, then reference them:
es: Almacene todas las imágenes en la carpeta `images/`, luego refiéralas:

source: **To reference the figure in text:**
es: **Para referenciar la figura en el texto:**

source: Chapter Bibliography
es: Bibliografía del capítulo

source: Add this at the end of each chapter to generate a bibliography of cited works:
es: Agregue esto al final de cada capítulo para generar una bibliografía de las obras citadas:

source: Working with Interactive Notebooks
es: Trabajo con notebooks interactivos

source: When you create a `.ipynb` file:
es: Cuando cree un archivo `.ipynb`:

source: The launch button will automatically appear in the navbar
es: El botón de lanzamiento aparecerá automáticamente en la barra de navegación

source: Readers can click it to open the notebook in Google Colab
es: Los lectores pueden hacer clic en él para abrir el notebook en Google Colab

source: Make sure your notebook runs completely before committing
es: Asegúrese de que su notebook se ejecute completamente antes de confirmar cambios

source: Adding Citations
es: Añadiendo citas

source: Add new references to the `bibliography.bib` file in BibTeX format
es: Agregue nuevas referencias al archivo `bibliography.bib` en formato BibTeX

source: Use the citation key in your lesson files
es: Use la clave de citación en sus archivos de lección

source: The bibliography will automatically generate
es: La bibliografía se generará automáticamente

source: Example BibTeX entry:
es: Ejemplo de entrada BibTeX:

source: Publishing Process
es: Proceso de publicación

source: The book uses **GitHub Actions** for automatic publishing:
es: El libro utiliza **GitHub Actions** para la publicación automática:

source: **Make changes** to any `.md` or `.ipynb` file
es: **Realice cambios** en cualquier archivo `.md` o `.ipynb`

source: **Commit and push** to the repository
es: **Confirme y envíe** al repositorio

source: **GitHub Actions automatically builds** the book
es: **GitHub Actions compila automáticamente** el libro

source: **Changes appear live** on the published site
es: **Los cambios aparecen** en directo en el sitio publicado

source: What triggers a rebuild:
es: Qué desencadena una reconstrucción:

source: Changes to lesson files (`.md`, `.ipynb`)
es: Cambios en los archivos de lecciones (`.md`, `.ipynb`)

source: Changes to configuration files (`_config.yml`, `_toc.yml`)
es: Cambios en los archivos de configuración (`_config.yml`, `_toc.yml`)

source: Changes to the bibliography file
es: Cambios en el archivo de bibliografía

source: New images added to the `images/` folder
es: Nuevas imágenes agregadas a la carpeta `images/`

source: Troubleshooting
es: Solución de problemas

source: Common Issues:
es: Problemas comunes:

source: **Build fails:**
es: **Error de compilación:**

source: Check syntax in your markdown/notebook files
es: Verifique la sintaxis en sus archivos markdown/notebook

source: Ensure all referenced images exist in the `images/` folder
es: Asegúrese de que todas las imágenes referenciadas existan en la carpeta `images/`

source: Verify citation keys exist in `bibliography.bib`
es: Verifique que las claves de citación existan en `bibliography.bib`

source: **Images not showing:**
es: **Imágenes no se muestran:**

source: Check file path (should be `images/filename.png`)
es: Verifique la ruta del archivo (debe ser `images/filename.png`)

source: Ensure image file exists and is committed to the repository
es: Asegúrese de que el archivo de imagen exista y esté comprometido en el repositorio

source: Verify image file extension matches the reference
es: Verifique que la extensión del archivo coincida con la referencia

source: **Citations not working:**
es: **Las citas no funcionan:**

source: Check that the citation key exists in `bibliography.bib`
es: Compruebe que la clave de citación exista en `bibliography.bib`

source: Ensure proper citation syntax: `{cite}` for basic, `{cite:p}` for multiple
es: Asegúrese de usar la sintaxis correcta de citación: `{cite}` para básica, `{cite:p}` para múltiples

source: **Interactive features not working:**
es: **Funciones interactivas no funcionan:**

source: For notebooks, ensure the `.ipynb` file is properly formatted
es: Para notebooks, asegúrese de que el archivo `.ipynb` esté correctamente formateado

source: Check that code cells run without errors
es: Verifique que las celdas de código se ejecuten sin errores

source: Quick Checklist for New Lessons
es: Lista de verificación rápida para nuevas lecciones

source: File created with appropriate extension (`.md` or `.ipynb`)
es: Archivo creado con la extensión adecuada (`.md` o `.ipynb`)

source: Added to `_toc.yml`
es: Agregado en `_toc.yml`

source: Includes author card at the beginning
es: Incluye la tarjeta del autor al principio

source: Includes lesson type tag
es: Incluye la etiqueta de tipo de lección

source: All images stored in `images/` folder
es: Todas las imágenes almacenadas en la carpeta `images/`

source: Citations properly formatted and exist in bibliography
es: Citas correctamente formateadas y existentes en la bibliografía

source: Content follows formatting guidelines
es: El contenido sigue las pautas de formato

source: File saved and pushed to repository
es: Archivo guardado y enviado al repositorio
